2018-01-11_bash.tex
% Created 2017-12-15 Fri 14:33
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Nick Waters}
\date{\today}
\title{Bash scripting\\\medskip
\large Version 1.0}
\hypersetup{
 pdfauthor={Nick Waters},
 pdftitle={Bash scripting},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.0.6)},
 pdflang={English}}
\begin{document}

\maketitle
\section*{Introducing the Shell}
\label{sec:org5a577fa}
\subsection*{What is a command shell and why would I use one?}
\label{sec:org0cd04ce}

\subsubsection*{Reproducibility}
\label{sec:org1d9e2c2}
\begin{itemize}
\item saves time for repetative tasks
\item easier to automate
\end{itemize}

\subsubsection*{Use Case}
\label{sec:org0315578}
\subsubsection*{not more fun to manipulate}
\label{sec:org70c4326}
Say you need to row

\begin{NOTES}
harder to do one thing once, but much easier to do one thing 10000x
\end{NOTES}
\section*{Navigating Files and Directories}
\label{sec:org72e084c}

\subsubsection*{How can I move around on my computer?}
\label{sec:org66c6bd2}
\subsubsection*{How can I see what files and directories I have?}
\label{sec:orgf08a3ea}
\subsection*{How can I specify the location of a file or directory on my computer?}
\label{sec:orgcc3706d}
\section*{Working With Files and Directories}
\label{sec:orgec316d5}
\begin{itemize}
\item How can I create, copy, and delete files and directories?
\item How can I edit files?
\end{itemize}
\section*{Pipes and Filters}
\label{sec:org566376f}
\begin{itemize}
\item How can I combine existing commands to do new things?
\end{itemize}
\section*{Loops}
\label{sec:org7676337}
\begin{itemize}
\item How can I perform the same actions on many different files?
\end{itemize}
\section*{Shell Scripts}
\label{sec:org5d053dc}
\begin{itemize}
\item How can I save and re-use commands?
\end{itemize}
\section*{Finding Things}
\label{sec:org9a180c6}
\begin{itemize}
\item How can I find files?
\item How can I find things in files?
\end{itemize}
\end{document}